apache/nuttx/arch/arm/src/kinetis/kinetis_usbdev.c
#define KHCI_EP_DISABLED  (0)
#define KHCI_EP_CONTROL   (USB_ENDPT_EPHSHK | USB_ENDPT_EPTXEN | USB_ENDPT_EPRXEN)
#define KHCI_EP_BULKIN    (USB_ENDPT_EPTXEN | USB_ENDPT_EPCTLDIS | USB_ENDPT_EPHSHK)
#define KHCI_EP_BULKOUT   (USB_ENDPT_EPRXEN | USB_ENDPT_EPCTLDIS | USB_ENDPT_EPHSHK)
#define KHCI_EP_INTIN     (USB_ENDPT_EPTXEN | USB_ENDPT_EPCTLDIS | USB_ENDPT_EPHSHK)
#define KHCI_EP_INTOUT    (USB_ENDPT_EPRXEN | USB_ENDPT_EPCTLDIS | USB_ENDPT_EPHSHK)
#define KHCI_EP_ISOCIN    (USB_ENDPT_EPTXEN | USB_ENDPT_EPCTLDIS)
#define KHCI_EP_ISOCOUT   (USB_ENDPT_EPRXEN | USB_ENDPT_EPCTLDIS)

/* USB-related masks */

#define REQRECIPIENT_MASK (USB_REQ_TYPE_MASK | USB_REQ_RECIPIENT_MASK)

/* Request queue operations *************************************************/

#define khci_rqempty(q)   ((q)->head == NULL)
#define khci_rqhead(q)    ((q)->head)
#define khci_rqtail(q)    ((q)->tail)

#define RESTART_DELAY     (150 * CLOCKS_PER_SEC / 1000)

#define USB0_USBTRC0_BIT6 0x40 /* Undocumented bit that is set in the
                                * Kinetis lib
                                */

/* USB trace ****************************************************************/

/* Trace error codes */

#define KHCI_TRACEERR_ALLOCFAIL            0x0001
#define KHCI_TRACEERR_BADCLEARFEATURE      0x0002
#define KHCI_TRACEERR_BADDEVGETSTATUS      0x0003
#define KHCI_TRACEERR_BADEPGETSTATUS       0x0004
#define KHCI_TRACEERR_BADEPNO              0x0005
#define KHCI_TRACEERR_BADEPTYPE            0x0006
#define KHCI_TRACEERR_BADGETCONFIG         0x0007
#define KHCI_TRACEERR_BADGETSETDESC        0x0008
#define KHCI_TRACEERR_BADGETSTATUS         0x0009
#define KHCI_TRACEERR_BADSETADDRESS        0x000a
#define KHCI_TRACEERR_BADSETCONFIG         0x000b
#define KHCI_TRACEERR_BADSETFEATURE        0x000c
#define KHCI_TRACEERR_BINDFAILED           0x000d
#define KHCI_TRACEERR_DISPATCHSTALL        0x000e
#define KHCI_TRACEERR_DRIVER               0x000f
#define KHCI_TRACEERR_DRIVERREGISTERED     0x0010
#define KHCI_TRACEERR_EP0SETUPSTALLED      0x0011
#define KHCI_TRACEERR_EPDISABLED           0x0012
#define KHCI_TRACEERR_EPOUTNULLPACKET      0x0013
#define KHCI_TRACEERR_EPRESERVE            0x0014
#define KHCI_TRACEERR_INVALIDCTRLREQ       0x0015
#define KHCI_TRACEERR_INVALIDPARMS         0x0016
#define KHCI_TRACEERR_IRQREGISTRATION      0x0017
#define KHCI_TRACEERR_NOTCONFIGURED        0x0018
#define KHCI_TRACEERR_REQABORTED           0x0019
#define KHCI_TRACEERR_INVALIDSTATE         0x001a

/* Trace interrupt codes */

#define KHCI_TRACEINTID_CLEARFEATURE       0x0001
#define KHCI_TRACEINTID_DEVGETSTATUS       0x0002
#define KHCI_TRACEINTID_DISPATCH           0x0003
#define KHCI_TRACEINTID_EP0IN              0x0004
#define KHCI_TRACEINTID_EP0INDONE          0x0005
#define KHCI_TRACEINTID_EP0OUTDONE         0x0006
#define KHCI_TRACEINTID_EP0SETUPDONE       0x0007
#define KHCI_TRACEINTID_EP0SETUPSETADDRESS 0x0008
#define KHCI_TRACEINTID_EP0ADDRESSSET      0x0009
#define KHCI_TRACEINTID_EPGETSTATUS        0x000a
#define KHCI_TRACEINTID_EPINDONE           0x000b
#define KHCI_TRACEINTID_EPINQEMPTY         0x000c
#define KHCI_TRACEINTID_EPOUTDONE          0x000d
#define KHCI_TRACEINTID_EPOUTQEMPTY        0x000e
#define KHCI_TRACEINTID_SOF                0x000f
#define KHCI_TRACEINTID_GETCONFIG          0x0010
#define KHCI_TRACEINTID_GETSETDESC         0x0011
#define KHCI_TRACEINTID_GETSETIF           0x0012
#define KHCI_TRACEINTID_GETSTATUS          0x0013
#define KHCI_TRACEINTID_IFGETSTATUS        0x0014
#define KHCI_TRACEINTID_TRNC               0x0015
#define KHCI_TRACEINTID_TRNCS              0x0016
#define KHCI_TRACEINTID_INTERRUPT          0x0017
#define KHCI_TRACEINTID_NOSTDREQ           0x0018
#define KHCI_TRACEINTID_RESET              0x0019
#define KHCI_TRACEINTID_SETCONFIG          0x001a
#define KHCI_TRACEINTID_SETFEATURE         0x001b
#define KHCI_TRACEINTID_IDLE               0x001c
#define KHCI_TRACEINTID_SYNCHFRAME         0x001d
#define KHCI_TRACEINTID_WKUP               0x001e
#define KHCI_TRACEINTID_T1MSEC             0x001f
#define KHCI_TRACEINTID_OTGID              0x0020
#define KHCI_TRACEINTID_STALL              0x0021
#define KHCI_TRACEINTID_UERR               0x0022
#define KHCI_TRACEINTID_SUSPENDED          0x0023
#define KHCI_TRACEINTID_RESUME             0x0024
#define KHCI_TRACEINTID_WAITRESET          0x0025
#define KHCI_TRACEINTID_EP0SETUPOUT        0x0026
#define KHCI_TRACEINTID_EP0SETUPOUTDATA    0x0027

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(KHCI_TRACEINTID_CLEARFEATURE),        /* 0x0001 */
  TRACE_STR(KHCI_TRACEINTID_DEVGETSTATUS),        /* 0x0002 */
  TRACE_STR(KHCI_TRACEINTID_DISPATCH),            /* 0x0003 */
  TRACE_STR(KHCI_TRACEINTID_EP0IN),               /* 0x0004 */
  TRACE_STR(KHCI_TRACEINTID_EP0INDONE),           /* 0x0005 */
  TRACE_STR(KHCI_TRACEINTID_EP0OUTDONE),          /* 0x0006 */
  TRACE_STR(KHCI_TRACEINTID_EP0SETUPDONE),        /* 0x0007 */
  TRACE_STR(KHCI_TRACEINTID_EP0SETUPSETADDRESS),  /* 0x0008 */
  TRACE_STR(KHCI_TRACEINTID_EP0ADDRESSSET),       /* 0x0009 */
  TRACE_STR(KHCI_TRACEINTID_EPGETSTATUS),         /* 0x000a */
  TRACE_STR(KHCI_TRACEINTID_EPINDONE),            /* 0x000b */
  TRACE_STR(KHCI_TRACEINTID_EPINQEMPTY),          /* 0x000c */
  TRACE_STR(KHCI_TRACEINTID_EPOUTDONE),           /* 0x000d */
  TRACE_STR(KHCI_TRACEINTID_EPOUTQEMPTY),         /* 0x000e */
  TRACE_STR(KHCI_TRACEINTID_SOF),                 /* 0x000f */
  TRACE_STR(KHCI_TRACEINTID_GETCONFIG),           /* 0x0010 */
  TRACE_STR(KHCI_TRACEINTID_GETSETDESC),          /* 0x0011 */
  TRACE_STR(KHCI_TRACEINTID_GETSETIF),            /* 0x0012 */
  TRACE_STR(KHCI_TRACEINTID_GETSTATUS),           /* 0x0013 */
  TRACE_STR(KHCI_TRACEINTID_IFGETSTATUS),         /* 0x0014 */
  TRACE_STR(KHCI_TRACEINTID_TRNC),                /* 0x0015 */
  TRACE_STR(KHCI_TRACEINTID_TRNCS),               /* 0x0016 */
  TRACE_STR(KHCI_TRACEINTID_INTERRUPT),           /* 0x0017 */
  TRACE_STR(KHCI_TRACEINTID_NOSTDREQ),            /* 0x0018 */
  TRACE_STR(KHCI_TRACEINTID_RESET),               /* 0x0019 */
  TRACE_STR(KHCI_TRACEINTID_SETCONFIG),           /* 0x001a */
  TRACE_STR(KHCI_TRACEINTID_SETFEATURE),          /* 0x001b */
  TRACE_STR(KHCI_TRACEINTID_IDLE),                /* 0x001c */
  TRACE_STR(KHCI_TRACEINTID_SYNCHFRAME),          /* 0x001d */
  TRACE_STR(KHCI_TRACEINTID_WKUP),                /* 0x001e */
  TRACE_STR(KHCI_TRACEINTID_T1MSEC),              /* 0x001f */
  TRACE_STR(KHCI_TRACEINTID_OTGID),               /* 0x0020 */
  TRACE_STR(KHCI_TRACEINTID_STALL),               /* 0x0021 */
  TRACE_STR(KHCI_TRACEINTID_UERR),                /* 0x0022 */
  TRACE_STR(KHCI_TRACEINTID_SUSPENDED),           /* 0x0023 */
  TRACE_STR(KHCI_TRACEINTID_RESUME),              /* 0x0024 */
  TRACE_STR(KHCI_TRACEINTID_WAITRESET),           /* 0x0025 */
  TRACE_STR(KHCI_TRACEINTID_EP0SETUPOUT),         /* 0x0026 */
  TRACE_STR(KHCI_TRACEINTID_EP0SETUPOUTDATA),     /* 0x0027 */
  TRACE_STR_END
};
#endif

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(KHCI_TRACEERR_ALLOCFAIL),             /* 0x0001 */
  TRACE_STR(KHCI_TRACEERR_BADCLEARFEATURE),       /* 0x0002 */
  TRACE_STR(KHCI_TRACEERR_BADDEVGETSTATUS),       /* 0x0003 */
  TRACE_STR(KHCI_TRACEERR_BADEPGETSTATUS),        /* 0x0004 */
  TRACE_STR(KHCI_TRACEERR_BADEPNO),               /* 0x0005 */
  TRACE_STR(KHCI_TRACEERR_BADEPTYPE),             /* 0x0006 */
  TRACE_STR(KHCI_TRACEERR_BADGETCONFIG),          /* 0x0007 */
  TRACE_STR(KHCI_TRACEERR_BADGETSETDESC),         /* 0x0008 */
  TRACE_STR(KHCI_TRACEERR_BADGETSTATUS),          /* 0x0009 */
  TRACE_STR(KHCI_TRACEERR_BADSETADDRESS),         /* 0x000a */
  TRACE_STR(KHCI_TRACEERR_BADSETCONFIG),          /* 0x000b */
  TRACE_STR(KHCI_TRACEERR_BADSETFEATURE),         /* 0x000c */
  TRACE_STR(KHCI_TRACEERR_BINDFAILED),            /* 0x000d */
  TRACE_STR(KHCI_TRACEERR_DISPATCHSTALL),         /* 0x000e */
  TRACE_STR(KHCI_TRACEERR_DRIVER),                /* 0x000f */
  TRACE_STR(KHCI_TRACEERR_DRIVERREGISTERED),      /* 0x0010 */
  TRACE_STR(KHCI_TRACEERR_EP0SETUPSTALLED),       /* 0x0011 */
  TRACE_STR(KHCI_TRACEERR_EPDISABLED),            /* 0x0012 */
  TRACE_STR(KHCI_TRACEERR_EPOUTNULLPACKET),       /* 0x0013 */
  TRACE_STR(KHCI_TRACEERR_EPRESERVE),             /* 0x0014 */
  TRACE_STR(KHCI_TRACEERR_INVALIDCTRLREQ),        /* 0x0015 */
  TRACE_STR(KHCI_TRACEERR_INVALIDPARMS),          /* 0x0016 */
  TRACE_STR(KHCI_TRACEERR_IRQREGISTRATION),       /* 0x0017 */
  TRACE_STR(KHCI_TRACEERR_NOTCONFIGURED),         /* 0x0018 */
  TRACE_STR(KHCI_TRACEERR_REQABORTED),            /* 0x0019 */
  TRACE_STR(KHCI_TRACEERR_INVALIDSTATE),          /* 0x001a */
  TRACE_STR_END
};
#endif

